Tekla Open API Reference for Tekla Structures 2025
CustomLineTypeCatalog.Get Method
Overload List
Name | Description
Get()
 Gets all the available CustomLineType's.
Get(Int32)
 Gets the CustomLineType with the specified ID.
Get(String)
 Gets the CustomLineType with the specified Name.
Top
See Also
Reference
CustomLineTypeCatalog Class
Tekla.Structures.Drawing Namespace